In [68]:
import pandas as pd
import numpy as np

two objects : series(columns) and dataframe(table)

In [69]:
n1=pd.Series([100,200,300],index=['a','b','c'])

In [70]:
n1

a    100
b    200
c    300
dtype: int64

In [71]:
n1.index=["aa","bb","cc"]
n1

aa    100
bb    200
cc    300
dtype: int64

In [72]:
n1[0]

C:\Users\asus\AppData\Local\Temp\ipykernel_19628\460056605.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  n1[0]

np.int64(100)

In [73]:
n1["aa"]

np.int64(100)

In [74]:
type(n1)

pandas.core.series.Series

In [75]:
df=pd.DataFrame({"Name":["abc","xyz","pqr"],
                 "Marks":[100,200,300],
                 "Subjects":["Maths","Physics","Chemistry"],
                "RollNo":[1,2,3]})

In [76]:
df

  Name  Marks   Subjects  RollNo
0  abc    100      Maths       1
1  xyz    200    Physics       2
2  pqr    300  Chemistry       3

In [77]:
type(df)

pandas.core.frame.DataFrame

In [78]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [79]:
df.columns

Index(['Name', 'Marks', 'Subjects', 'RollNo'], dtype='object')

In [80]:
df['Name']

0    abc
1    xyz
2    pqr
Name: Name, dtype: object

In [81]:
type(df['Marks'])

pandas.core.series.Series

In [82]:
df['Name']=['a','b','c']
df

  Name  Marks   Subjects  RollNo
0    a    100      Maths       1
1    b    200    Physics       2
2    c    300  Chemistry       3

loc and iloc function

In [83]:
df.iloc[0::2,0::2]  # start_row:end_row:row_step, start_col:end_col:col_step

  Name   Subjects
0    a      Maths
2    c  Chemistry

In [84]:
df.loc[0:2,"Name"::2]     # row name start: row name end : step, column name start : column name end : step

  Name   Subjects
0    a      Maths
1    b    Physics
2    c  Chemistry

In [85]:
df.loc[0:2,['Name','Subjects']]     # row name start: row name end : step, column name start : column name end : step

  Name   Subjects
0    a      Maths
1    b    Physics
2    c  Chemistry

In [ ]:
# df['Marks']==100 
# df[df['Marks']==100]

In [89]:
# x.loc[:,"Marks"]=125
df.loc[df['Marks']==100,'Marks']=125

In [90]:
df

  Name  Marks   Subjects  RollNo
0    a    125      Maths       1
1    b    200    Physics       2
2    c    300  Chemistry       3

In [92]:
df.loc[df['Subjects']=="Maths",'Subjects']="Physics"
df

  Name  Marks   Subjects  RollNo
0    a    125    Physics       1
1    b    200    Physics       2
2    c    300  Chemistry       3

In [95]:
df.loc[df['Marks']>100,'Marks']=df['Marks']+100
df

  Name  Marks   Subjects  RollNo
0    a    225    Physics       1
1    b    300    Physics       2
2    c    400  Chemistry       3

In [99]:
df.loc[(df['Marks']>250) & (df['Marks']<500),['Marks']]=df['Marks']-100
df

  Name  Marks   Subjects  RollNo
0    a    225    Physics       1
1    b    100    Physics       2
2    c    200  Chemistry       3